Revit 2027 API
RevisionNumberingSequence.GetAlphanumericRevisionSettings Method
 Returns a copy of the AlphanumericRevisionSettings owned by this revision numbering sequence.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AlphanumericRevisionSettings GetAlphanumericRevisionSettings()
Public Function GetAlphanumericRevisionSettings As AlphanumericRevisionSettings
public:
AlphanumericRevisionSettings^ GetAlphanumericRevisionSettings()
member GetAlphanumericRevisionSettings : unit -> AlphanumericRevisionSettings
Return Value
AlphanumericRevisionSettings
 The copy of the AlphaumericRevisionSettings owned by this revision numbering sequence.
Exceptions
Exception | Condition
InvalidOperationException |  This RevisionNumberingSequence doesn't own a valid alphanumeric revision settings.
See Also
Reference
RevisionNumberingSequence Class
Autodesk.Revit.DB Namespace